src/bsl/Catalogs/гкс_КлючиАналитикиСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_КлючиАналитикиСРПВ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВагона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_НомерВагона</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправкиВагона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_WagonDispatchID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЛК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Catalogs/гкс_КлючиАналитикиСРПВ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ссылку на документ по идентификатору отправки
//
// Параметры:
//  ЗначенияКлючевыхПолей - Структура - значения полей поиска
//		* НомерВагона - Строка - номер вагона
//		* ИдентификаторОтправкиВагона - Число
//
//	ЭтоНовый - Булево - установить Истина если будет создан новй элемент
//
// Возвращаемое значение:
//	СправочникСсылка.гкс_КлючиАналитикиСРПВ - ссылка на элемент справочника
//
Функция ЗначениеКлючаАналитики(ЗначенияКлючевыхПолей, ЭтоНовый = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлючиАналитикиСРПВ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.гкс_КлючиАналитикиСРПВ КАК КлючиАналитикиСРПВ
	|ГДЕ
	|	КлючиАналитикиСРПВ.ИдентификаторОтправкиВагона = &ИдентификаторОтправкиВагона
	|	И КлючиАналитикиСРПВ.НомерВагона = &НомерВагона
	|	И КлючиАналитикиСРПВ.ТипОперации = &ТипОперации";
	
	Запрос.УстановитьПараметр("ИдентификаторОтправкиВагона", ЗначенияКлючевыхПолей.ИдентификаторОтправкиВагона);
	Запрос.УстановитьПараметр("НомерВагона", ЗначенияКлючевыхПолей.НомерВагона);
	Запрос.УстановитьПараметр("ТипОперации", ЗначенияКлючевыхПолей.ТипОперации);
	
	РезультатЗапроса = Запрос.Выполнить();	
		
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	Иначе
		НовыйЭлемент = СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЗначенияКлючевыхПолей);
		НовыйЭлемент.Записать();
		Результат = НовыйЭлемент.Ссылка; 
		ЭтоНовый = Истина;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции
	
#КонецОбласти

#Область ОбработчикиСобытий

//// Вызывается для формирования состава полей, из которых формируется 
//// представление справочника транспортных средств.
////
//// Параметры:
////  Поля                 - Массив - массив, содержащий имена полей, которые нужны для формирования представления объекта
////                                  или ссылки.
////  СтандартнаяОбработка - Булево - в данный параметр передается признак выполнения стандартной (системной) обработки события.
////                                  Если в теле процедуры-обработчика установить данному параметру значение Ложь,
////                                  стандартная обработка события производиться не будет.
////
//Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) Экспорт 
//	
//	Поля.Добавить("НомерВагона");
//	Поля.Добавить("ИдентификаторОтправкиВагона");
//	
//	СтандартнаяОбработка = Ложь;
//	
//КонецПроцедуры

//// Вызывается при получении представления справочника.
////
//// Параметры:
////  Данные               - Структура - содержит значения полей, из которых формируется представление.
////  Представление        - Строка - в данный параметр нужно поместить сформированное представление.
////  СтандартнаяОбработка - Булево - в данный параметр передается признак формирования стандартного представления.
////
//Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
//		
//	Представление = СокрЛП(СтрШаблон("%1; %2", Данные.НомерВагона, Данные.ИдентификаторОтправкиВагона));
//	
//	СтандартнаяОбработка = Ложь;
//	
//КонецПроцедуры

#КонецОбласти

#КонецЕсли
